---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimValueLength
source: html/438c57ee-b0e8-7083-1971-7e4cfdc8116b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimValueLength Property

"Value"

## Syntax (C#)
```csharp
public static ForgeTypeId DimValueLength { get; }
```